Step 1. Import the necessary libraries

In [113]:
import pandas as pd

Step 2. Read dataset, and assign it to a variable called users and use the ’user_id’ as index

In [114]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users = pd.read_csv(url, sep='|', index_col='user_id')

Step 3. See the first 25 entries

In [115]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

Step 4. See the last 10 entries

In [116]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

Step 5. What is the number of observations in the dataset?

In [117]:
users.shape[0]

943

Step 6. What is number of columns in the dataset

In [118]:
users.shape[1]

4

Step 7: Print the name of all columns

In [119]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

Step 8: How is the dataset index?

In [120]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

Step 9. What is the data type of each column?

In [121]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

Step 10. Print only the occupation column

In [122]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

Step 11. How many different occupations are in this dataset?

In [123]:
users.occupation.nunique()

21

In [124]:
# check result step 11
# user_occupation_list = users.groupby('occupation').sum()
# user_occupation_list

Step 12. What is the most frequent occupation?

In [125]:
occupation_count = users['occupation'].value_counts()  # sort True by default
occupation_count.head(1)

student    196
Name: occupation, dtype: int64

Step 13. Summarize the DataFrame.

In [126]:
round(users.describe(),2)

          age
count  943.00
mean    34.05
std     12.19
min      7.00
25%     25.00
50%     31.00
75%     43.00
max     73.00

Step 14. Summarize all the columns

In [127]:
cols = ['gender', 'occupation', 'zip_code']
users[cols].describe()

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

Step 15. Summarize only the occupation column

In [128]:
users['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

Step 16. What is the mean age of users?

In [129]:
round(users['age'].mean(),2)

34.05

Step 17. What is the age with least occurrence?

In [130]:
user_age = users.groupby('age')['age'].count().reset_index(name="age_occurence")
min_age_occurence = user_age['age_occurence'].min()
user_age.loc[user_age['age_occurence'] == min_age_occurence].reset_index()

   index  age  age_occurence
0      0    7              1
1      1   10              1
2      2   11              1
3     56   66              1
4     60   73              1